WF/src/Catalogs/ВебСайт_АлгоритмыПолученияДанных/ВебСайт_АлгоритмыПолученияДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВебСайт_АлгоритмыПолученияДанных</name>
  <attributes>
    <name>ИмяФайлаJSON</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмПолученияДанных</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПримерЗагрушка</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Страницы</name>
    <attributes>
      <name>Страница</name>
      <type>
        <types>CatalogRef.ВебСайт</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

WF/src/CommonModules/ВебСайт_ПовтИспШаблонизаторPug/Module.bsl
// Получает полное относительное имя файла PUG в каталоге шаблонов PUG
Функция ПолучитьПолноеИмяФайлаpug(Страница) Экспорт 
	
	Возврат ПолучитьПолноеИмяФайлаPUGРекурсивно(Страница, "");	
	
КонецФункции

Функция ПолучитьПолноеИмяФайлаPUGРекурсивно(Страница, Путь)
	
	НовыйПуть = "";
	НовыйПуть = Путь + "\" + Страница.Наименование;
	Если ЗначениеЗаполнено(Страница.Родитель) Тогда
		Возврат ПолучитьПолноеИмяФайлаPUGРекурсивно(Страница.Родитель, НовыйПуть);
	Иначе
		Возврат НовыйПуть;
	КонецЕсли;	
	
КонецФункции

// Получает в массив все алгоритмы заполнения для страницы
Функция ПолучитьАлгоритмыЗаполнения(Страница) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВебСайт_АлгоритмыПолученияДанныхСтраницы.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ВебСайт_АлгоритмыПолученияДанных.Страницы КАК ВебСайт_АлгоритмыПолученияДанныхСтраницы
	               |ГДЕ
	               |	ВебСайт_АлгоритмыПолученияДанныхСтраницы.Страница = &Страница
	               |	И ВебСайт_АлгоритмыПолученияДанныхСтраницы.Ссылка.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("Страница",Страница );
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции
